import React, { Component } from 'react';
import Switchable from './Switchable';

export class Content extends Component {
    render() {
        return (
            <div>
                <p>Освіта: Ліцей №4 м. Бердичів, НТУУ "КПІ", м. Київ</p>
                <p>Хоббі:</p>
                <ul>
                    <li>Вивчення мов</li>
                    <li>
                        <Switchable>Перегляд фільмів</Switchable>
                    </li>
                    <li>
                        <Switchable>Читання книг</Switchable>
                    </li>
                </ul>
                <p>Улюблені фільми:</p>
                <ol>
                    <li>З міркувань совісті</li>
                    <li>Ножі наголо</li>
                    <li>Інтерстеллар</li>
                </ol>
                <h3>Львів</h3>
                <p>
                    Місто в Україні, адміністративний центр області,
                    агломерації, району, міської громади, національно-культурний
                    та освітньо-науковий осередок країни, великий промисловий
                    центр і транспортний вузол, вважається столицею Галичини та
                    центром Західної України. За кількістю населення — сьоме
                    місто країни (717 273 станом на 01.01.2022).
                </p>
            </div>
        );
    }
}

export default Content;
